In [99]:
import numpy as np
import pandas as pd

#problem 1
1) create a pandas series from list x = [13, -5, 17, 9]
2) Create a Series using NumPy array having values "23, 3.0, 7, 11" and specify index values as "a, b, c, d"
3) Get the index and values of the above Series

In [3]:
#1) create a pandas series from list x = [13, -5, 17, 9]
lst = [13, -5, 7, 9]
ser = pd.Series(lst)
ser

0    13
1    -5
2     7
3     9
dtype: int64

In [4]:
#2) Create a Series using NumPy array having values "23, 3.0, 7, 11" and specify index values as "a, b, c, d"
np_arr = np.array([23, 3.0, 7, 11])
ser1 = pd.Series(np_arr, index=['a', 'b', 'c', 'd'])
ser1

a    23.0
b     3.0
c     7.0
d    11.0
dtype: float64

In [7]:
#3) Get the index and values of the above Series
for inx, val in ser1.items():
    print(inx, val)

a 23.0
b 3.0
c 7.0
d 11.0

In [8]:
ser1.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [100]:
ser1.values

array([23.,  3.,  7., 11.])

Problem 2 
From the raw data below Create a Pandas Series
'Amit', 'bob', 'Kaye', 'A', 'b', np.nan, 'Car', 'Dog', 'Cat'
1) Print all the elements in lower case
2) Print all the elements in upper case
3) Print  the length of elements

In [101]:
ser = pd.Series(['Amit', 'bob', 'Kaye', 'A', 'b', np.nan, 'Car', 'Dog', 'Cat'])
print(ser.str.lower())
print(ser.str.upper())
print(ser.str.len())

0    amit
1     bob
2    kaye
3       a
4       b
5     NaN
6     car
7     dog
8     cat
dtype: object
0    AMIT
1     BOB
2    KAYE
3       A
4       B
5     NaN
6     CAR
7     DOG
8     CAT
dtype: object
0    4.0
1    3.0
2    4.0
3    1.0
4    1.0
5    NaN
6    3.0
7    3.0
8    3.0
dtype: float64

Problem 3
From the raw data below Create a Pandas Series
'Arya', 'john ', ' jack', 'sam'
1)Print all elements after stripping spaces from left and right
2)Print all elements after removing spaces from left only
3)Print all elements after stripping spaces from right

In [102]:
s = pd.Series(['Arya', 'john ', ' jack', 'sam'])
print(s.str.strip())
print(s.str.lstrip())
print(s.str.rstrip())

0    Arya
1    john
2    jack
3     sam
dtype: object
0     Arya
1    john
2     jack
3      sam
dtype: object
0     Arya
1     john
2     jack
3      sam
dtype: object

Problem 4
Problem Statement: Creating Pandas Series
Write a Python program to create two lists - one for countries and another for
country codes. Create a pandas series from these two lists with the codes as the
index. Print the length, shape, and size of the series too.

In [104]:
country = ['India', 'Australia', 'China', 'japan', 'England', 'France']
codes = ['ind', 'aus', 'chn', 'jap', 'eng', 'Fra']
ser = pd.Series(country, index=[codes])
print(ser)
print(len(ser))
print(ser.size)
print(ser.shape)

ind        India
aus    Australia
chn        China
jap        japan
eng      England
Fra       France
dtype: object
6
6
(6,)

#Problem 5
Problem Statement: Creating Pandas DataFrame
Write a Python program that reads Name, Age, and Roll no. as input from the
user and stores it into a DataFrame, and printsthe DataFrame you have created.

In [103]:
n = int(input("Enter number of students: "))

names = []
ages = []
roll_nos = []

for i in range(n):
    print(f"\nEnter details for student {i+1}")
    name = input("Enter Name: ")
    age = int(input("Enter Age: "))
    roll_no = int(input("Enter Roll No: "))

    names.append(name)
    ages.append(age)
    roll_nos.append(roll_no)

# Create DataFrame
data = {
    "Name": names,
    "Age": ages,
    "Roll_no": roll_nos
}

df = pd.DataFrame(data)
print("\nStudent DataFrame:")
print(df)

Enter number of students: 3

Enter details for student 1
Enter Name: pavan
Enter Age: 18
Enter Roll No: 72

Enter details for student 2
Enter Name: vishnu
Enter Age: 19
Enter Roll No: 93

Enter details for student 3
Enter Name: mohith
Enter Age: 21
Enter Roll No: 68

Student DataFrame:
     Name  Age  Roll_no
0   pavan   18       72
1  vishnu   19       93
2  mohith   21       68

In [105]:
Problem 5
From the raw data below Create a DataFrame
"first_name" : ['Json', 'Molly', 'Tina', 'Jake', 'Amy'],
"last_name" : ['Miller', 'jacobson', '', 'Milner', 'cooze'],
"age":[42, 52, 36, 24, 73],
"preTestScore": [4, 14, 31, '', ''],
"pstTestScore": ['25,000', '94,000', 57, 62, 70]

In [106]:
dict = {
    "first_name" : ['Json', 'Molly', 'Tina', 'Jake', 'Amy'],
    "last_name" : ['Miller', 'jacobson', '', 'Milner', 'cooze'],
    "age":[42, 52, 36, 24, 73],
    "preTestScore": [4, 14, 31, '', ''],
    "pstTestScore": ['25,000', '94,000', 57, 62, 70]
}
df=pd.DataFrame(dict)

Problem 6
2) Save the DataFrame into a CSV file as example.csv
3) Read the example.csv and print the data frame
4) Read the example.csv without column heading
5) Read the example.csv and make the index columns as 'First Name' and 'Last Name'
6) Read the first 3 rows of the DataFrame and print the DataFrame

In [30]:
df.to_csv("example.csv")

In [32]:
data=pd.read_csv("example.csv")
data

   Unnamed: 0 first_name last_name  age  preTestScore pstTestScore
0           0       Json    Miller   42           4.0       25,000
1           1      Molly  jacobson   52          14.0       94,000
2           2       Tina       NaN   36          31.0           57
3           3       Jake    Milner   24           NaN           62
4           4        Amy     cooze   73           NaN           70

In [39]:
data=pd.read_csv("example.csv", index_col = ['first_name', 'last_name'])

In [40]:
data=pd.read_csv("example.csv", index_col = ['first_name', 'last_name'], nrows=3)
data

                      Unnamed: 0  age  preTestScore pstTestScore
first_name last_name
Json       Miller              0   42             4       25,000
Molly      jacobson            1   52            14       94,000
Tina       NaN                 2   36            31           57

In [42]:
df = pd.read_csv("nba.csv")

In [43]:
df.head(10)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0

In [44]:
df.tail(5)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [51]:
df['Weight'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 458 entries, 0 to 457
Series name: Weight
Non-Null Count  Dtype
--------------  -----
457 non-null    float64
dtypes: float64(1)
memory usage: 3.7 KB

In [48]:
df.head(15)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0
10,Jared Sullinger,Boston Celtics,7.0,C,24.0,6-9,260.0,Ohio State,2569260.0
11,Isaiah Thomas,Boston Celtics,4.0,PG,27.0,5-9,185.0,Washington,6912869.0
12,Evan Turner,Boston Celtics,11.0,SG,27.0,6-7,220.0,Ohio State,3425510.0
13,James Young,Boston Celtics,13.0,SG,20.0,6-6,215.0,Kentucky,1749840.0
14,Tyler Zeller,Boston Celtics,44.0,C,26.0,7-0,253.0,North Carolina,2616975.0

In [53]:
df['country'] = ""
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,country
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0,
...,...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0,
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0,
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0,
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0,
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,

In [55]:
df.drop("Number", axis=1)

,Name,Team,Position,Age,Height,Weight,College,Salary,country
0,Avery Bradley,Boston Celtics,PG,25.0,6-2,180.0,Texas,7730337.0,
1,Jae Crowder,Boston Celtics,SF,25.0,6-6,235.0,Marquette,6796117.0,
2,John Holland,Boston Celtics,SG,27.0,6-5,205.0,Boston University,NaN,
3,R.J. Hunter,Boston Celtics,SG,22.0,6-5,185.0,Georgia State,1148640.0,
4,Jonas Jerebko,Boston Celtics,PF,29.0,6-10,231.0,NaN,5000000.0,
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,PG,26.0,6-3,203.0,Butler,2433333.0,
454,Raul Neto,Utah Jazz,PG,24.0,6-1,179.0,NaN,900000.0,
455,Tibor Pleiss,Utah Jazz,C,26.0,7-3,256.0,NaN,2900000.0,
456,Jeff Withey,Utah Jazz,C,26.0,7-0,231.0,Kansas,947276.0,
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,

In [62]:
display(df[(df['Weight'] > 210.0) & (df['Age'] > 30)])

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,country
31,Lou Amundson,New York Knicks,17.0,PF,33.0,6-9,220.0,UNLV,1635476.0,
33,Carmelo Anthony,New York Knicks,7.0,SF,32.0,6-8,240.0,Syracuse,22875000.0,
46,Elton Brand,Philadelphia 76ers,42.0,PF,37.0,6-9,254.0,Duke,NaN,
52,Carl Landry,Philadelphia 76ers,7.0,PF,32.0,6-9,248.0,Purdue,6500000.0,
72,Luis Scola,Toronto Raptors,4.0,PF,36.0,6-9,240.0,NaN,2900000.0,
...,...,...,...,...,...,...,...,...,...,...
406,Tayshaun Prince,Minnesota Timberwolves,12.0,SF,36.0,6-9,212.0,Kentucky,947276.0,
413,Nick Collison,Oklahoma City Thunder,4.0,PF,35.0,6-10,255.0,Kansas,3750000.0,
415,Randy Foye,Oklahoma City Thunder,6.0,SG,32.0,6-4,213.0,Villanova,3135000.0,
420,Nazr Mohammed,Oklahoma City Thunder,13.0,C,38.0,6-10,250.0,Kentucky,222888.0,
434,Chris Kaman,Portland Trail Blazers,35.0,C,34.0,7-0,265.0,Central Michigan,5016000.0,

In [65]:
display(df.sort_values(by='Height', ascending=False))

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,country
40,Kristaps Porzingis,New York Knicks,6.0,PF,20.0,7-3,240.0,NaN,4131720.0,
322,Walter Tavares,Atlanta Hawks,22.0,C,24.0,7-3,260.0,NaN,1000000.0,
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0,
302,Boban Marjanovic,San Antonio Spurs,40.0,C,27.0,7-3,290.0,NaN,1200000.0,
111,Roy Hibbert,Los Angeles Lakers,17.0,C,29.0,7-2,270.0,Georgetown,15592217.0,
...,...,...,...,...,...,...,...,...,...,...
11,Isaiah Thomas,Boston Celtics,4.0,PG,27.0,5-9,185.0,Washington,6912869.0,
203,Ty Lawson,Indiana Pacers,10.0,PG,28.0,5-11,195.0,North Carolina,211744.0,
22,Shane Larkin,Brooklyn Nets,0.0,PG,23.0,5-11,175.0,Miami (FL),1500000.0,
130,Phil Pressey,Phoenix Suns,25.0,PG,25.0,5-11,175.0,Missouri,55722.0,
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,

#Problem Statement: Data Filtering using Pandas

Write a Python program that reads the player.csv (provided on LMS) file into a
DataFrame, then shows only those players who played more than 150 innings
and scored at least two centuries and 35 fifties.

In [82]:
#solution
data = pd.read_csv("player.csv")
data

   rank             name  matches  innings  runs  highest  100s  50s
0     1          V Kohli      207      199  6283      113     5   42
1     2         S Dhawan      194      191  5784      106     2   44
2     3     Rohit Sharma      213      208  5611      109     1   40
3     4     Suresh Raina      205      200  5528      100     1   39
4     5     David Warner      150      150  5449      126     4   50
5     6  A B de Villiers      184      170  5162      133     3   40
6     7      Chris Gayle      142      141  4965      175     6   31
7     8        M S Dhoni      220      193  4746       84     0   23
8     9    Robin Uthappa      193      186  4722       87     0   25
9    10    Gutam Gambhir      154      152  4217       93     0   36

In [83]:
display(data[(data['innings'] > 150) & (data['100s'] > 2) & (data['50s'] >= 35)])

   rank             name  matches  innings  runs  highest  100s  50s
0     1          V Kohli      207      199  6283      113     5   42
5     6  A B de Villiers      184      170  5162      133     3   40

In [ ]:
#problem 2
1. Remove the data of players who didn't score a single century
2. Replace the player name "V Kohli " with "Virat Kohli â€œ
3. How many matches they weren't getting a chance for batting to fetch
that and stored in a new column and named it as â€œnot battingâ€
4. Fetch data where they scored neither 100 nor 50 in matches and
store it in the new column as renamed as â€œlow score inningsâ€

In [87]:
#1.Remove the data of players who didn't score a single century
df = data.drop(df[df['100s'] == 0].index)

In [88]:
df

   rank             name  matches  innings  runs  highest  100s  50s
0     1          V Kohli      207      199  6283      113     5   42
1     2         S Dhawan      194      191  5784      106     2   44
2     3     Rohit Sharma      213      208  5611      109     1   40
3     4     Suresh Raina      205      200  5528      100     1   39
4     5     David Warner      150      150  5449      126     4   50
5     6  A B de Villiers      184      170  5162      133     3   40
6     7      Chris Gayle      142      141  4965      175     6   31

In [96]:
#2. Replace the player name "V Kohli " with "Virat Kohli â€œ
df1 = data.replace("V Kohli", "virat kohli")
df1

,rank,name,matches,innings,runs,highest,100s,50s,not_played,low_score_innings
0,1,virat kohli,207,199,6283,113,5,42,8,152
1,2,S Dhawan,194,191,5784,106,2,44,3,145
2,3,Rohit Sharma,213,208,5611,109,1,40,5,167
3,4,Suresh Raina,205,200,5528,100,1,39,5,160
4,5,David Warner,150,150,5449,126,4,50,0,96
5,6,A B de Villiers,184,170,5162,133,3,40,14,127
6,7,Chris Gayle,142,141,4965,175,6,31,1,104
7,8,M S Dhoni,220,193,4746,84,0,23,27,170
8,9,Robin Uthappa,193,186,4722,87,0,25,7,161
9,10,Gutam Gambhir,154,152,4217,93,0,36,2,116

In [94]:
#3. How many matches they weren't getting a chance for batting to fetch
that and stored in a new column and named it as â€œnot battingâ€
data['not_played'] = data['matches'] - data['innings']
data

,rank,name,matches,innings,runs,highest,100s,50s,not_played
0,1,V Kohli,207,199,6283,113,5,42,8
1,2,S Dhawan,194,191,5784,106,2,44,3
2,3,Rohit Sharma,213,208,5611,109,1,40,5
3,4,Suresh Raina,205,200,5528,100,1,39,5
4,5,David Warner,150,150,5449,126,4,50,0
5,6,A B de Villiers,184,170,5162,133,3,40,14
6,7,Chris Gayle,142,141,4965,175,6,31,1
7,8,M S Dhoni,220,193,4746,84,0,23,27
8,9,Robin Uthappa,193,186,4722,87,0,25,7
9,10,Gutam Gambhir,154,152,4217,93,0,36,2

In [95]:
#4.Fetch data where they scored neither 100 nor 50 in matches andstore it in the new column as renamed as â€œlow score inningsâ€
data['low_score_innings'] = data['innings'] - (data['100s'] + data['50s'])
data

,rank,name,matches,innings,runs,highest,100s,50s,not_played,low_score_innings
0,1,V Kohli,207,199,6283,113,5,42,8,152
1,2,S Dhawan,194,191,5784,106,2,44,3,145
2,3,Rohit Sharma,213,208,5611,109,1,40,5,167
3,4,Suresh Raina,205,200,5528,100,1,39,5,160
4,5,David Warner,150,150,5449,126,4,50,0,96
5,6,A B de Villiers,184,170,5162,133,3,40,14,127
6,7,Chris Gayle,142,141,4965,175,6,31,1,104
7,8,M S Dhoni,220,193,4746,84,0,23,27,170
8,9,Robin Uthappa,193,186,4722,87,0,25,7,161
9,10,Gutam Gambhir,154,152,4217,93,0,36,2,116